; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v2 - type_2 ?v1 - type_1)
 	      (pred_3 ?v5 - object ?v1 - type_1)
	      (pred_1 ?v2 - type_2 ?v4 - type_3)
	      (pred_4 ?v2 - type_2 ?v5 - object ?v4 - type_3))

   (:action op_3
       :parameters  (?v2 - type_2 ?v6 ?v8 - type_1)
       :precondition (and  (pred_2 ?v2 ?v6))
       :effect (and  (pred_2 ?v2 ?v8)
		     (not (pred_2 ?v2 ?v6))))

   (:action op_2
       :parameters (?v2 - type_2 ?v3 - object ?v7 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v3 ?v7) (pred_2 ?v2 ?v7) (pred_1 ?v2 ?v4))
       :effect (and (pred_4 ?v2 ?v3 ?v4)
		    (not (pred_3 ?v3 ?v7)) 
		    (not (pred_1 ?v2 ?v4))))

   (:action op_1
       :parameters (?v2 - type_2 ?v3 - object ?v7 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v3 ?v4) (pred_2 ?v2 ?v7))
       :effect (and (pred_3 ?v3 ?v7)
		    (pred_1 ?v2 ?v4)
		    (not (pred_4 ?v2 ?v3 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_08 - type_2
obj_04 obj_05 obj_13 obj_10 - type_3
obj_14 obj_09 obj_01 obj_12 - type_1
obj_02 obj_03 obj_11 obj_06 - object)
(:init
(pred_2 obj_07 obj_14)
(pred_1 obj_07 obj_04)
(pred_1 obj_07 obj_05)
(pred_2 obj_08 obj_14)
(pred_1 obj_08 obj_13)
(pred_1 obj_08 obj_10)
(pred_3 obj_02 obj_12)
(pred_3 obj_03 obj_14)
(pred_3 obj_11 obj_01)
(pred_3 obj_06 obj_14)
)
(:goal
(and
(pred_3 obj_02 obj_14)
(pred_3 obj_03 obj_14)
(pred_3 obj_11 obj_09)
(pred_3 obj_06 obj_09)
)
)

(:constraints
  (always (not (pred_2 obj_07 obj_01)))
)
)

; plan
1. (op_2 obj_07 obj_06 obj_14 obj_05)
   deleted: (pred_3 obj_06 obj_14) (pred_1 obj_07 obj_05)
   added: (pred_4 obj_07 obj_06 obj_05)
   goals met: 1 of 4
2. (op_3 obj_08 obj_14 obj_12)
   deleted: (pred_2 obj_08 obj_14)
   added: (pred_2 obj_08 obj_12)
   goals met: 1 of 4
3. (op_3 obj_07 obj_14 obj_09)
   deleted: (pred_2 obj_07 obj_14)
   added: (pred_2 obj_07 obj_09)
   goals met: 1 of 4
4. (op_2 obj_08 obj_02 obj_12 obj_10)
   deleted: (pred_3 obj_02 obj_12) (pred_1 obj_08 obj_10)
   added: (pred_4 obj_08 obj_02 obj_10)
   goals met: 1 of 4
5. (op_1 obj_07 obj_06 obj_09 obj_05)
   deleted: (pred_4 obj_07 obj_06 obj_05)
   added: (pred_3 obj_06 obj_09) (pred_1 obj_07 obj_05)
   goals met: 2 of 4
6. (op_3 obj_08 obj_12 obj_01)
   deleted: (pred_2 obj_08 obj_12)
   added: (pred_2 obj_08 obj_01)
   goals met: 2 of 4
7. (op_2 obj_08 obj_11 obj_01 obj_13)
   deleted: (pred_3 obj_11 obj_01) (pred_1 obj_08 obj_13)
   added: (pred_4 obj_08 obj_11 obj_13)
   goals met: 2 of 4
8. (op_3 obj_08 obj_01 obj_09)
   deleted: (pred_2 obj_08 obj_01)
   added: (pred_2 obj_08 obj_09)
   goals met: 2 of 4
9. (op_1 obj_08 obj_11 obj_09 obj_13)
   deleted: (pred_4 obj_08 obj_11 obj_13)
   added: (pred_3 obj_11 obj_09) (pred_1 obj_08 obj_13)
   goals met: 3 of 4
10. (op_3 obj_08 obj_09 obj_14)
   deleted: (pred_2 obj_08 obj_09)
   added: (pred_2 obj_08 obj_14)
   goals met: 3 of 4
11. (op_1 obj_08 obj_02 obj_14 obj_10)
   deleted: (pred_4 obj_08 obj_02 obj_10)
   added: (pred_3 obj_02 obj_14) (pred_1 obj_08 obj_10)
   goals met: 4 of 4
